program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.7.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [661059]> audio) {
            tensor<int32, [3]> var_24 = const()[name = string("op_24"), val = tensor<int32, [3]>([1, 1, 661059])];
            tensor<fp16, [1, 1, 661059]> input_3_cast_fp16 = reshape(shape = var_24, x = audio)[name = string("input_3_cast_fp16")];
            tensor<int32, [6]> input_5_pad_0 = const()[name = string("input_5_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 512, 512])];
            string input_5_mode_0 = const()[name = string("input_5_mode_0"), val = string("reflect")];
            fp16 const_3_to_fp16 = const()[name = string("const_3_to_fp16"), val = fp16(0x0p+0)];
            tensor<fp16, [1, 1, 662083]> input_5_cast_fp16 = pad(constant_val = const_3_to_fp16, mode = input_5_mode_0, pad = input_5_pad_0, x = input_3_cast_fp16)[name = string("input_5_cast_fp16")];
            tensor<int32, [2]> var_30 = const()[name = string("op_30"), val = tensor<int32, [2]>([1, 662083])];
            tensor<fp16, [1, 662083]> input_7_cast_fp16 = reshape(shape = var_30, x = input_5_cast_fp16)[name = string("input_7_cast_fp16")];
            tensor<int32, [1]> expand_dims_2 = const()[name = string("expand_dims_2"), val = tensor<int32, [1]>([441])];
            tensor<int32, [1]> expand_dims_3_axes_0 = const()[name = string("expand_dims_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 662083]> expand_dims_3_cast_fp16 = expand_dims(axes = expand_dims_3_axes_0, x = input_7_cast_fp16)[name = string("expand_dims_3_cast_fp16")];
            string conv_0_pad_type_0 = const()[name = string("conv_0_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> conv_0_pad_0 = const()[name = string("conv_0_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> conv_0_dilations_0 = const()[name = string("conv_0_dilations_0"), val = tensor<int32, [1]>([1])];
            int32 conv_0_groups_0 = const()[name = string("conv_0_groups_0"), val = int32(1)];
            tensor<fp16, [513, 1, 1024]> _inversed_real_div_1_weight_0_to_fp16 = const()[name = string("_inversed_real_div_1_weight_0_to_fp16"), val = tensor<fp16, [513, 1, 1024]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            tensor<fp16, [513]> _inversed_real_div_1_bias_0_to_fp16 = const()[name = string("_inversed_real_div_1_bias_0_to_fp16"), val = tensor<fp16, [513]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1050752)))];
            tensor<fp16, [1, 513, 1500]> _inversed_real_div_1_cast_fp16 = conv(bias = _inversed_real_div_1_bias_0_to_fp16, dilations = conv_0_dilations_0, groups = conv_0_groups_0, pad = conv_0_pad_0, pad_type = conv_0_pad_type_0, strides = expand_dims_2, weight = _inversed_real_div_1_weight_0_to_fp16, x = expand_dims_3_cast_fp16)[name = string("_inversed_real_div_1_cast_fp16")];
            string conv_1_pad_type_0 = const()[name = string("conv_1_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> conv_1_pad_0 = const()[name = string("conv_1_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> conv_1_dilations_0 = const()[name = string("conv_1_dilations_0"), val = tensor<int32, [1]>([1])];
            int32 conv_1_groups_0 = const()[name = string("conv_1_groups_0"), val = int32(1)];
            tensor<fp16, [513, 1, 1024]> _inversed_real_div_2_weight_0_to_fp16 = const()[name = string("_inversed_real_div_2_weight_0_to_fp16"), val = tensor<fp16, [513, 1, 1024]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1051904)))];
            tensor<fp16, [1, 513, 1500]> _inversed_real_div_2_cast_fp16 = conv(bias = _inversed_real_div_1_bias_0_to_fp16, dilations = conv_1_dilations_0, groups = conv_1_groups_0, pad = conv_1_pad_0, pad_type = conv_1_pad_type_0, strides = expand_dims_2, weight = _inversed_real_div_2_weight_0_to_fp16, x = expand_dims_3_cast_fp16)[name = string("_inversed_real_div_2_cast_fp16")];
            tensor<int32, [2]> var_35 = const()[name = string("op_35"), val = tensor<int32, [2]>([513, 1500])];
            tensor<fp16, [513, 1500]> spec_f_cast_fp16 = reshape(shape = var_35, x = _inversed_real_div_1_cast_fp16)[name = string("spec_f_cast_fp16")];
            tensor<fp16, [513, 1500]> spec_f_1_cast_fp16 = reshape(shape = var_35, x = _inversed_real_div_2_cast_fp16)[name = string("spec_f_1_cast_fp16")];
            tensor<fp16, [513, 1500]> square_0_cast_fp16 = square(x = spec_f_cast_fp16)[name = string("square_0_cast_fp16")];
            tensor<fp16, [513, 1500]> square_1_cast_fp16 = square(x = spec_f_1_cast_fp16)[name = string("square_1_cast_fp16")];
            tensor<fp16, [513, 1500]> add_1_cast_fp16 = add(x = square_0_cast_fp16, y = square_1_cast_fp16)[name = string("add_1_cast_fp16")];
            tensor<fp16, [513, 1500]> sqrt_1_cast_fp16 = sqrt(x = add_1_cast_fp16)[name = string("sqrt_1_cast_fp16")];
            tensor<int32, [2]> var_39_perm_0 = const()[name = string("op_39_perm_0"), val = tensor<int32, [2]>([-1, -2])];
            tensor<fp16, [128, 513]> transpose_0_to_fp16 = const()[name = string("transpose_0_to_fp16"), val = tensor<fp16, [128, 513]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2102592)))];
            tensor<fp16, [128]> var_40_bias_0_to_fp16 = const()[name = string("op_40_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2233984)))];
            tensor<fp16, [1500, 513]> var_39_cast_fp16 = transpose(perm = var_39_perm_0, x = sqrt_1_cast_fp16)[name = string("transpose_96")];
            tensor<fp16, [1500, 128]> var_40_cast_fp16 = linear(bias = var_40_bias_0_to_fp16, weight = transpose_0_to_fp16, x = var_39_cast_fp16)[name = string("op_40_cast_fp16")];
            fp16 var_43_promoted_to_fp16 = const()[name = string("op_43_promoted_to_fp16"), val = fp16(0x1.f4p+9)];
            tensor<fp16, [1500, 128]> var_44_cast_fp16 = mul(x = var_40_cast_fp16, y = var_43_promoted_to_fp16)[name = string("op_44_cast_fp16")];
            fp32 var_45_epsilon_0 = const()[name = string("op_45_epsilon_0"), val = fp32(0x1p+0)];
            tensor<fp16, [1500, 128]> var_45_cast_fp16 = log(epsilon = var_45_epsilon_0, x = var_44_cast_fp16)[name = string("op_45_cast_fp16")];
            tensor<int32, [1]> x_1_axes_0 = const()[name = string("x_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 1500, 128]> x_1_cast_fp16 = expand_dims(axes = x_1_axes_0, x = var_45_cast_fp16)[name = string("x_1_cast_fp16")];
            bool var_55 = const()[name = string("op_55"), val = bool(true)];
            tensor<int32, [3]> var_84_perm_0 = const()[name = string("op_84_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [128]> model_frontend_stem_bn1d_running_mean_to_fp16 = const()[name = string("model_frontend_stem_bn1d_running_mean_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2234304)))];
            tensor<fp16, [128]> model_frontend_stem_bn1d_running_var_to_fp16 = const()[name = string("model_frontend_stem_bn1d_running_var_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2234624)))];
            tensor<fp16, [128]> model_frontend_stem_bn1d_weight_to_fp16 = const()[name = string("model_frontend_stem_bn1d_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2234944)))];
            tensor<fp16, [128]> model_frontend_stem_bn1d_bias_to_fp16 = const()[name = string("model_frontend_stem_bn1d_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2235264)))];
            fp16 var_54_to_fp16 = const()[name = string("op_54_to_fp16"), val = fp16(0x1.5p-17)];
            tensor<fp16, [1, 128, 1500]> var_84_cast_fp16 = transpose(perm = var_84_perm_0, x = x_1_cast_fp16)[name = string("transpose_95")];
            tensor<fp16, [1, 128, 1500]> x_3_cast_fp16 = batch_norm(beta = model_frontend_stem_bn1d_bias_to_fp16, epsilon = var_54_to_fp16, gamma = model_frontend_stem_bn1d_weight_to_fp16, mean = model_frontend_stem_bn1d_running_mean_to_fp16, variance = model_frontend_stem_bn1d_running_var_to_fp16, x = var_84_cast_fp16)[name = string("x_3_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = string("input_11_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 128, 1500]> input_11_cast_fp16 = expand_dims(axes = input_11_axes_0, x = x_3_cast_fp16)[name = string("input_11_cast_fp16")];
            string input_13_pad_type_0 = const()[name = string("input_13_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = string("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> input_13_strides_0 = const()[name = string("input_13_strides_0"), val = tensor<int32, [2]>([4, 1])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = string("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 input_13_groups_0 = const()[name = string("input_13_groups_0"), val = int32(1)];
            tensor<fp16, [32, 1, 4, 3]> const_104_to_fp16 = const()[name = string("const_104_to_fp16"), val = tensor<fp16, [32, 1, 4, 3]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2235584)))];
            tensor<fp16, [32]> const_105_to_fp16 = const()[name = string("const_105_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2236416)))];
            tensor<fp16, [1, 32, 32, 1500]> input_15_cast_fp16 = conv(bias = const_105_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = const_104_to_fp16, x = input_11_cast_fp16)[name = string("input_15_cast_fp16")];
            string x_5_mode_0 = const()[name = string("x_5_mode_0"), val = string("EXACT")];
            tensor<fp16, [1, 32, 32, 1500]> x_5_cast_fp16 = gelu(mode = x_5_mode_0, x = input_15_cast_fp16)[name = string("x_5_cast_fp16")];
            tensor<int32, [4]> var_122 = const()[name = string("op_122"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [3]> concat_0 = const()[name = string("concat_0"), val = tensor<int32, [3]>([1500, 32, 32])];
            tensor<fp16, [1, 1500, 32, 32]> var_123_cast_fp16 = transpose(perm = var_122, x = x_5_cast_fp16)[name = string("transpose_94")];
            tensor<fp16, [1500, 32, 32]> input_17_cast_fp16 = reshape(shape = concat_0, x = var_123_cast_fp16)[name = string("input_17_cast_fp16")];
            tensor<int32, [1]> var_132 = const()[name = string("op_132"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1500, 32, 1]> var_133_cast_fp16 = reduce_l2_norm(axes = var_132, keep_dims = var_55, x = input_17_cast_fp16)[name = string("op_133_cast_fp16")];
            fp16 var_59_to_fp16 = const()[name = string("op_59_to_fp16"), val = fp16(0x1p-24)];
            tensor<fp16, [1500, 32, 1]> var_134_cast_fp16 = maximum(x = var_133_cast_fp16, y = var_59_to_fp16)[name = string("op_134_cast_fp16")];
            tensor<int32, [3]> denom_1_reps_0 = const()[name = string("denom_1_reps_0"), val = tensor<int32, [3]>([1, 1, 32])];
            tensor<fp16, [1500, 32, 32]> denom_1_cast_fp16 = tile(reps = denom_1_reps_0, x = var_134_cast_fp16)[name = string("denom_1_cast_fp16")];
            tensor<fp16, [1500, 32, 32]> var_136_cast_fp16 = real_div(x = input_17_cast_fp16, y = denom_1_cast_fp16)[name = string("op_136_cast_fp16")];
            fp16 var_137_to_fp16 = const()[name = string("op_137_to_fp16"), val = fp16(0x1.6ap+2)];
            tensor<fp16, [1500, 32, 32]> var_138_cast_fp16 = mul(x = var_136_cast_fp16, y = var_137_to_fp16)[name = string("op_138_cast_fp16")];
            tensor<fp16, [32]> model_frontend_blocks_0_partial_attnF_norm_gamma_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnF_norm_gamma_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2236544)))];
            tensor<fp16, [1500, 32, 32]> input_19_cast_fp16 = mul(x = var_138_cast_fp16, y = model_frontend_blocks_0_partial_attnF_norm_gamma_to_fp16)[name = string("input_19_cast_fp16")];
            tensor<fp16, [96, 32]> model_frontend_blocks_0_partial_attnF_to_qkv_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnF_to_qkv_weight_to_fp16"), val = tensor<fp16, [96, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2236672)))];
            tensor<fp16, [96]> linear_0_bias_0_to_fp16 = const()[name = string("linear_0_bias_0_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2242880)))];
            tensor<fp16, [1500, 32, 96]> linear_0_cast_fp16 = linear(bias = linear_0_bias_0_to_fp16, weight = model_frontend_blocks_0_partial_attnF_to_qkv_weight_to_fp16, x = input_19_cast_fp16)[name = string("linear_0_cast_fp16")];
            tensor<int32, [5]> concat_1 = const()[name = string("concat_1"), val = tensor<int32, [5]>([1500, 32, 3, 1, -1])];
            tensor<fp16, [1500, 32, 3, 1, 32]> var_143_cast_fp16 = reshape(shape = concat_1, x = linear_0_cast_fp16)[name = string("op_143_cast_fp16")];
            tensor<int32, [5]> var_144 = const()[name = string("op_144"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> t_1_begin_0 = const()[name = string("t_1_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> t_1_end_0 = const()[name = string("t_1_end_0"), val = tensor<int32, [5]>([1, 1500, 1, 32, 32])];
            tensor<bool, [5]> t_1_end_mask_0 = const()[name = string("t_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> t_1_squeeze_mask_0 = const()[name = string("t_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1500, 1, 32, 32]> qkv_1_cast_fp16 = transpose(perm = var_144, x = var_143_cast_fp16)[name = string("transpose_93")];
            tensor<fp16, [1500, 1, 32, 32]> t_1_cast_fp16 = slice_by_index(begin = t_1_begin_0, end = t_1_end_0, end_mask = t_1_end_mask_0, squeeze_mask = t_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = string("t_1_cast_fp16")];
            tensor<int32, [5]> t_3_begin_0 = const()[name = string("t_3_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> t_3_end_0 = const()[name = string("t_3_end_0"), val = tensor<int32, [5]>([2, 1500, 1, 32, 32])];
            tensor<bool, [5]> t_3_end_mask_0 = const()[name = string("t_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> t_3_squeeze_mask_0 = const()[name = string("t_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1500, 1, 32, 32]> t_3_cast_fp16 = slice_by_index(begin = t_3_begin_0, end = t_3_end_0, end_mask = t_3_end_mask_0, squeeze_mask = t_3_squeeze_mask_0, x = qkv_1_cast_fp16)[name = string("t_3_cast_fp16")];
            tensor<int32, [5]> v_1_begin_0 = const()[name = string("v_1_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_1_end_0 = const()[name = string("v_1_end_0"), val = tensor<int32, [5]>([3, 1500, 1, 32, 32])];
            tensor<bool, [5]> v_1_end_mask_0 = const()[name = string("v_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_1_squeeze_mask_0 = const()[name = string("v_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1500, 1, 32, 32]> v_1_cast_fp16 = slice_by_index(begin = v_1_begin_0, end = v_1_end_0, end_mask = v_1_end_mask_0, squeeze_mask = v_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = string("v_1_cast_fp16")];
            tensor<fp16, [32, 32]> var_161_to_fp16 = const()[name = string("op_161_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2243136)))];
            tensor<fp16, [1500, 1, 32, 32]> var_162_cast_fp16 = mul(x = t_1_cast_fp16, y = var_161_to_fp16)[name = string("op_162_cast_fp16")];
            tensor<int32, [5]> concat_4 = const()[name = string("concat_4"), val = tensor<int32, [5]>([1500, 1, 32, -1, 2])];
            tensor<fp16, [1500, 1, 32, 16, 2]> x_7_cast_fp16 = reshape(shape = concat_4, x = t_1_cast_fp16)[name = string("x_7_cast_fp16")];
            tensor<int32, [5]> x1_1_begin_0 = const()[name = string("x1_1_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> x1_1_end_0 = const()[name = string("x1_1_end_0"), val = tensor<int32, [5]>([1500, 1, 32, 16, 1])];
            tensor<bool, [5]> x1_1_end_mask_0 = const()[name = string("x1_1_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x1_1_squeeze_mask_0 = const()[name = string("x1_1_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1500, 1, 32, 16]> x1_1_cast_fp16 = slice_by_index(begin = x1_1_begin_0, end = x1_1_end_0, end_mask = x1_1_end_mask_0, squeeze_mask = x1_1_squeeze_mask_0, x = x_7_cast_fp16)[name = string("x1_1_cast_fp16")];
            tensor<int32, [5]> x2_1_begin_0 = const()[name = string("x2_1_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 1])];
            tensor<int32, [5]> x2_1_end_0 = const()[name = string("x2_1_end_0"), val = tensor<int32, [5]>([1500, 1, 32, 16, 2])];
            tensor<bool, [5]> x2_1_end_mask_0 = const()[name = string("x2_1_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x2_1_squeeze_mask_0 = const()[name = string("x2_1_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1500, 1, 32, 16]> x2_1_cast_fp16 = slice_by_index(begin = x2_1_begin_0, end = x2_1_end_0, end_mask = x2_1_end_mask_0, squeeze_mask = x2_1_squeeze_mask_0, x = x_7_cast_fp16)[name = string("x2_1_cast_fp16")];
            fp16 const_11_promoted_to_fp16 = const()[name = string("const_11_promoted_to_fp16"), val = fp16(-0x1p+0)];
            tensor<fp16, [1500, 1, 32, 16]> var_167_cast_fp16 = mul(x = x2_1_cast_fp16, y = const_11_promoted_to_fp16)[name = string("op_167_cast_fp16")];
            int32 var_169_axis_0 = const()[name = string("op_169_axis_0"), val = int32(-1)];
            tensor<fp16, [1500, 1, 32, 16, 2]> var_169_cast_fp16 = stack(axis = var_169_axis_0, values = (var_167_cast_fp16, x1_1_cast_fp16))[name = string("op_169_cast_fp16")];
            tensor<int32, [4]> concat_5 = const()[name = string("concat_5"), val = tensor<int32, [4]>([1500, 1, 32, 32])];
            tensor<fp16, [1500, 1, 32, 32]> var_170_cast_fp16 = reshape(shape = concat_5, x = var_169_cast_fp16)[name = string("op_170_cast_fp16")];
            tensor<fp16, [32, 32]> var_171_to_fp16 = const()[name = string("op_171_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2245248)))];
            tensor<fp16, [1500, 1, 32, 32]> var_172_cast_fp16 = mul(x = var_170_cast_fp16, y = var_171_to_fp16)[name = string("op_172_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 32]> q_1_cast_fp16 = add(x = var_162_cast_fp16, y = var_172_cast_fp16)[name = string("q_1_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 32]> var_187_cast_fp16 = mul(x = t_3_cast_fp16, y = var_161_to_fp16)[name = string("op_187_cast_fp16")];
            tensor<int32, [5]> concat_8 = const()[name = string("concat_8"), val = tensor<int32, [5]>([1500, 1, 32, -1, 2])];
            tensor<fp16, [1500, 1, 32, 16, 2]> x_9_cast_fp16 = reshape(shape = concat_8, x = t_3_cast_fp16)[name = string("x_9_cast_fp16")];
            tensor<int32, [5]> x1_3_begin_0 = const()[name = string("x1_3_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> x1_3_end_0 = const()[name = string("x1_3_end_0"), val = tensor<int32, [5]>([1500, 1, 32, 16, 1])];
            tensor<bool, [5]> x1_3_end_mask_0 = const()[name = string("x1_3_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x1_3_squeeze_mask_0 = const()[name = string("x1_3_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1500, 1, 32, 16]> x1_3_cast_fp16 = slice_by_index(begin = x1_3_begin_0, end = x1_3_end_0, end_mask = x1_3_end_mask_0, squeeze_mask = x1_3_squeeze_mask_0, x = x_9_cast_fp16)[name = string("x1_3_cast_fp16")];
            tensor<int32, [5]> x2_3_begin_0 = const()[name = string("x2_3_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 1])];
            tensor<int32, [5]> x2_3_end_0 = const()[name = string("x2_3_end_0"), val = tensor<int32, [5]>([1500, 1, 32, 16, 2])];
            tensor<bool, [5]> x2_3_end_mask_0 = const()[name = string("x2_3_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x2_3_squeeze_mask_0 = const()[name = string("x2_3_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [1500, 1, 32, 16]> x2_3_cast_fp16 = slice_by_index(begin = x2_3_begin_0, end = x2_3_end_0, end_mask = x2_3_end_mask_0, squeeze_mask = x2_3_squeeze_mask_0, x = x_9_cast_fp16)[name = string("x2_3_cast_fp16")];
            fp16 const_15_promoted_to_fp16 = const()[name = string("const_15_promoted_to_fp16"), val = fp16(-0x1p+0)];
            tensor<fp16, [1500, 1, 32, 16]> var_192_cast_fp16 = mul(x = x2_3_cast_fp16, y = const_15_promoted_to_fp16)[name = string("op_192_cast_fp16")];
            int32 var_194_axis_0 = const()[name = string("op_194_axis_0"), val = int32(-1)];
            tensor<fp16, [1500, 1, 32, 16, 2]> var_194_cast_fp16 = stack(axis = var_194_axis_0, values = (var_192_cast_fp16, x1_3_cast_fp16))[name = string("op_194_cast_fp16")];
            tensor<int32, [4]> concat_9 = const()[name = string("concat_9"), val = tensor<int32, [4]>([1500, 1, 32, 32])];
            tensor<fp16, [1500, 1, 32, 32]> var_195_cast_fp16 = reshape(shape = concat_9, x = var_194_cast_fp16)[name = string("op_195_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 32]> var_197_cast_fp16 = mul(x = var_195_cast_fp16, y = var_171_to_fp16)[name = string("op_197_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 32]> k_1_cast_fp16 = add(x = var_187_cast_fp16, y = var_197_cast_fp16)[name = string("k_1_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 32]> out_1_cast_fp16 = scaled_dot_product_attention(key = k_1_cast_fp16, query = q_1_cast_fp16, value = v_1_cast_fp16)[name = string("out_1_cast_fp16")];
            tensor<fp16, [1, 32]> model_frontend_blocks_0_partial_attnF_to_gates_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnF_to_gates_weight_to_fp16"), val = tensor<fp16, [1, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2247360)))];
            tensor<fp16, [1]> model_frontend_blocks_0_partial_attnF_to_gates_bias_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnF_to_gates_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.3c4p-6])];
            tensor<fp16, [1500, 32, 1]> linear_1_cast_fp16 = linear(bias = model_frontend_blocks_0_partial_attnF_to_gates_bias_to_fp16, weight = model_frontend_blocks_0_partial_attnF_to_gates_weight_to_fp16, x = input_19_cast_fp16)[name = string("linear_1_cast_fp16")];
            tensor<int32, [3]> var_203 = const()[name = string("op_203"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> gates_1_axes_0 = const()[name = string("gates_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1500, 1, 32]> var_204_cast_fp16 = transpose(perm = var_203, x = linear_1_cast_fp16)[name = string("transpose_92")];
            tensor<fp16, [1500, 1, 32, 1]> gates_1_cast_fp16 = expand_dims(axes = gates_1_axes_0, x = var_204_cast_fp16)[name = string("gates_1_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 1]> var_206_cast_fp16 = sigmoid(x = gates_1_cast_fp16)[name = string("op_206_cast_fp16")];
            tensor<fp16, [1500, 1, 32, 32]> out_3_cast_fp16 = mul(x = out_1_cast_fp16, y = var_206_cast_fp16)[name = string("out_3_cast_fp16")];
            tensor<int32, [4]> var_208 = const()[name = string("op_208"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_10 = const()[name = string("concat_10"), val = tensor<int32, [3]>([1500, 32, 32])];
            tensor<fp16, [1500, 32, 1, 32]> var_209_cast_fp16 = transpose(perm = var_208, x = out_3_cast_fp16)[name = string("transpose_91")];
            tensor<fp16, [1500, 32, 32]> input_21_cast_fp16 = reshape(shape = concat_10, x = var_209_cast_fp16)[name = string("input_21_cast_fp16")];
            tensor<fp16, [32, 32]> model_frontend_blocks_0_partial_attnF_to_out_0_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnF_to_out_0_weight_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2247488)))];
            tensor<fp16, [32]> linear_2_bias_0_to_fp16 = const()[name = string("linear_2_bias_0_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2249600)))];
            tensor<fp16, [1500, 32, 32]> linear_2_cast_fp16 = linear(bias = linear_2_bias_0_to_fp16, weight = model_frontend_blocks_0_partial_attnF_to_out_0_weight_to_fp16, x = input_21_cast_fp16)[name = string("linear_2_cast_fp16")];
            tensor<fp16, [1500, 32, 32]> input_25_cast_fp16 = add(x = input_17_cast_fp16, y = linear_2_cast_fp16)[name = string("input_25_cast_fp16")];
            tensor<int32, [1]> var_221 = const()[name = string("op_221"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1500, 32, 1]> var_222_cast_fp16 = reduce_l2_norm(axes = var_221, keep_dims = var_55, x = input_25_cast_fp16)[name = string("op_222_cast_fp16")];
            tensor<fp16, [1500, 32, 1]> var_223_cast_fp16 = maximum(x = var_222_cast_fp16, y = var_59_to_fp16)[name = string("op_223_cast_fp16")];
            tensor<int32, [3]> denom_3_reps_0 = const()[name = string("denom_3_reps_0"), val = tensor<int32, [3]>([1, 1, 32])];
            tensor<fp16, [1500, 32, 32]> denom_3_cast_fp16 = tile(reps = denom_3_reps_0, x = var_223_cast_fp16)[name = string("denom_3_cast_fp16")];
            tensor<fp16, [1500, 32, 32]> var_225_cast_fp16 = real_div(x = input_25_cast_fp16, y = denom_3_cast_fp16)[name = string("op_225_cast_fp16")];
            fp16 var_226_to_fp16 = const()[name = string("op_226_to_fp16"), val = fp16(0x1.6ap+2)];
            tensor<fp16, [1500, 32, 32]> var_227_cast_fp16 = mul(x = var_225_cast_fp16, y = var_226_to_fp16)[name = string("op_227_cast_fp16")];
            tensor<fp16, [32]> model_frontend_blocks_0_partial_ffF_net_0_gamma_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffF_net_0_gamma_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2249728)))];
            tensor<fp16, [1500, 32, 32]> input_27_cast_fp16 = mul(x = var_227_cast_fp16, y = model_frontend_blocks_0_partial_ffF_net_0_gamma_to_fp16)[name = string("input_27_cast_fp16")];
            tensor<fp16, [128, 32]> model_frontend_blocks_0_partial_ffF_net_1_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffF_net_1_weight_to_fp16"), val = tensor<fp16, [128, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2249856)))];
            tensor<fp16, [128]> model_frontend_blocks_0_partial_ffF_net_1_bias_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffF_net_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2258112)))];
            tensor<fp16, [1500, 32, 128]> linear_3_cast_fp16 = linear(bias = model_frontend_blocks_0_partial_ffF_net_1_bias_to_fp16, weight = model_frontend_blocks_0_partial_ffF_net_1_weight_to_fp16, x = input_27_cast_fp16)[name = string("linear_3_cast_fp16")];
            string input_31_mode_0 = const()[name = string("input_31_mode_0"), val = string("EXACT")];
            tensor<fp16, [1500, 32, 128]> input_31_cast_fp16 = gelu(mode = input_31_mode_0, x = linear_3_cast_fp16)[name = string("input_31_cast_fp16")];
            tensor<fp16, [32, 128]> model_frontend_blocks_0_partial_ffF_net_4_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffF_net_4_weight_to_fp16"), val = tensor<fp16, [32, 128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2258432)))];
            tensor<fp16, [32]> model_frontend_blocks_0_partial_ffF_net_4_bias_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffF_net_4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2266688)))];
            tensor<fp16, [1500, 32, 32]> linear_4_cast_fp16 = linear(bias = model_frontend_blocks_0_partial_ffF_net_4_bias_to_fp16, weight = model_frontend_blocks_0_partial_ffF_net_4_weight_to_fp16, x = input_31_cast_fp16)[name = string("linear_4_cast_fp16")];
            tensor<fp16, [1500, 32, 32]> var_238_cast_fp16 = add(x = input_25_cast_fp16, y = linear_4_cast_fp16)[name = string("op_238_cast_fp16")];
            tensor<int32, [4]> concat_11 = const()[name = string("concat_11"), val = tensor<int32, [4]>([1, -1, 32, 32])];
            tensor<fp16, [1, 1500, 32, 32]> var_240_cast_fp16 = reshape(shape = concat_11, x = var_238_cast_fp16)[name = string("op_240_cast_fp16")];
            tensor<int32, [4]> var_241 = const()[name = string("op_241"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_12 = const()[name = string("concat_12"), val = tensor<int32, [3]>([32, 1500, 32])];
            tensor<fp16, [1, 32, 1500, 32]> var_242_cast_fp16 = transpose(perm = var_241, x = var_240_cast_fp16)[name = string("transpose_90")];
            tensor<fp16, [32, 1500, 32]> input_37_cast_fp16 = reshape(shape = concat_12, x = var_242_cast_fp16)[name = string("input_37_cast_fp16")];
            tensor<int32, [1]> var_249 = const()[name = string("op_249"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32, 1500, 1]> var_250_cast_fp16 = reduce_l2_norm(axes = var_249, keep_dims = var_55, x = input_37_cast_fp16)[name = string("op_250_cast_fp16")];
            tensor<fp16, [32, 1500, 1]> var_251_cast_fp16 = maximum(x = var_250_cast_fp16, y = var_59_to_fp16)[name = string("op_251_cast_fp16")];
            tensor<int32, [3]> denom_5_reps_0 = const()[name = string("denom_5_reps_0"), val = tensor<int32, [3]>([1, 1, 32])];
            tensor<fp16, [32, 1500, 32]> denom_5_cast_fp16 = tile(reps = denom_5_reps_0, x = var_251_cast_fp16)[name = string("denom_5_cast_fp16")];
            tensor<fp16, [32, 1500, 32]> var_253_cast_fp16 = real_div(x = input_37_cast_fp16, y = denom_5_cast_fp16)[name = string("op_253_cast_fp16")];
            fp16 var_254_to_fp16 = const()[name = string("op_254_to_fp16"), val = fp16(0x1.6ap+2)];
            tensor<fp16, [32, 1500, 32]> var_255_cast_fp16 = mul(x = var_253_cast_fp16, y = var_254_to_fp16)[name = string("op_255_cast_fp16")];
            tensor<fp16, [32]> model_frontend_blocks_0_partial_attnT_norm_gamma_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnT_norm_gamma_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2266816)))];
            tensor<fp16, [32, 1500, 32]> input_39_cast_fp16 = mul(x = var_255_cast_fp16, y = model_frontend_blocks_0_partial_attnT_norm_gamma_to_fp16)[name = string("input_39_cast_fp16")];
            tensor<fp16, [96, 32]> model_frontend_blocks_0_partial_attnT_to_qkv_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnT_to_qkv_weight_to_fp16"), val = tensor<fp16, [96, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2266944)))];
            tensor<fp16, [96]> linear_5_bias_0_to_fp16 = const()[name = string("linear_5_bias_0_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2273152)))];
            tensor<fp16, [32, 1500, 96]> linear_5_cast_fp16 = linear(bias = linear_5_bias_0_to_fp16, weight = model_frontend_blocks_0_partial_attnT_to_qkv_weight_to_fp16, x = input_39_cast_fp16)[name = string("linear_5_cast_fp16")];
            tensor<int32, [5]> concat_13 = const()[name = string("concat_13"), val = tensor<int32, [5]>([32, 1500, 3, 1, -1])];
            tensor<fp16, [32, 1500, 3, 1, 32]> var_260_cast_fp16 = reshape(shape = concat_13, x = linear_5_cast_fp16)[name = string("op_260_cast_fp16")];
            tensor<int32, [5]> var_261 = const()[name = string("op_261"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> t_5_begin_0 = const()[name = string("t_5_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> t_5_end_0 = const()[name = string("t_5_end_0"), val = tensor<int32, [5]>([1, 32, 1, 1500, 32])];
            tensor<bool, [5]> t_5_end_mask_0 = const()[name = string("t_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> t_5_squeeze_mask_0 = const()[name = string("t_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 32, 1, 1500, 32]> qkv_3_cast_fp16 = transpose(perm = var_261, x = var_260_cast_fp16)[name = string("transpose_89")];
            tensor<fp16, [32, 1, 1500, 32]> t_5_cast_fp16 = slice_by_index(begin = t_5_begin_0, end = t_5_end_0, end_mask = t_5_end_mask_0, squeeze_mask = t_5_squeeze_mask_0, x = qkv_3_cast_fp16)[name = string("t_5_cast_fp16")];
            tensor<int32, [5]> t_7_begin_0 = const()[name = string("t_7_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> t_7_end_0 = const()[name = string("t_7_end_0"), val = tensor<int32, [5]>([2, 32, 1, 1500, 32])];
            tensor<bool, [5]> t_7_end_mask_0 = const()[name = string("t_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> t_7_squeeze_mask_0 = const()[name = string("t_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [32, 1, 1500, 32]> t_7_cast_fp16 = slice_by_index(begin = t_7_begin_0, end = t_7_end_0, end_mask = t_7_end_mask_0, squeeze_mask = t_7_squeeze_mask_0, x = qkv_3_cast_fp16)[name = string("t_7_cast_fp16")];
            tensor<int32, [5]> v_3_begin_0 = const()[name = string("v_3_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_3_end_0 = const()[name = string("v_3_end_0"), val = tensor<int32, [5]>([3, 32, 1, 1500, 32])];
            tensor<bool, [5]> v_3_end_mask_0 = const()[name = string("v_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_3_squeeze_mask_0 = const()[name = string("v_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [32, 1, 1500, 32]> v_3_cast_fp16 = slice_by_index(begin = v_3_begin_0, end = v_3_end_0, end_mask = v_3_end_mask_0, squeeze_mask = v_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = string("v_3_cast_fp16")];
            tensor<fp16, [1500, 32]> var_278_to_fp16 = const()[name = string("op_278_to_fp16"), val = tensor<fp16, [1500, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2273408)))];
            tensor<fp16, [32, 1, 1500, 32]> var_279_cast_fp16 = mul(x = t_5_cast_fp16, y = var_278_to_fp16)[name = string("op_279_cast_fp16")];
            tensor<int32, [5]> concat_16 = const()[name = string("concat_16"), val = tensor<int32, [5]>([32, 1, 1500, -1, 2])];
            tensor<fp16, [32, 1, 1500, 16, 2]> x_11_cast_fp16 = reshape(shape = concat_16, x = t_5_cast_fp16)[name = string("x_11_cast_fp16")];
            tensor<int32, [5]> x1_5_begin_0 = const()[name = string("x1_5_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> x1_5_end_0 = const()[name = string("x1_5_end_0"), val = tensor<int32, [5]>([32, 1, 1500, 16, 1])];
            tensor<bool, [5]> x1_5_end_mask_0 = const()[name = string("x1_5_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x1_5_squeeze_mask_0 = const()[name = string("x1_5_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [32, 1, 1500, 16]> x1_5_cast_fp16 = slice_by_index(begin = x1_5_begin_0, end = x1_5_end_0, end_mask = x1_5_end_mask_0, squeeze_mask = x1_5_squeeze_mask_0, x = x_11_cast_fp16)[name = string("x1_5_cast_fp16")];
            tensor<int32, [5]> x2_5_begin_0 = const()[name = string("x2_5_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 1])];
            tensor<int32, [5]> x2_5_end_0 = const()[name = string("x2_5_end_0"), val = tensor<int32, [5]>([32, 1, 1500, 16, 2])];
            tensor<bool, [5]> x2_5_end_mask_0 = const()[name = string("x2_5_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x2_5_squeeze_mask_0 = const()[name = string("x2_5_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [32, 1, 1500, 16]> x2_5_cast_fp16 = slice_by_index(begin = x2_5_begin_0, end = x2_5_end_0, end_mask = x2_5_end_mask_0, squeeze_mask = x2_5_squeeze_mask_0, x = x_11_cast_fp16)[name = string("x2_5_cast_fp16")];
            fp16 const_19_promoted_to_fp16 = const()[name = string("const_19_promoted_to_fp16"), val = fp16(-0x1p+0)];
            tensor<fp16, [32, 1, 1500, 16]> var_284_cast_fp16 = mul(x = x2_5_cast_fp16, y = const_19_promoted_to_fp16)[name = string("op_284_cast_fp16")];
            int32 var_286_axis_0 = const()[name = string("op_286_axis_0"), val = int32(-1)];
            tensor<fp16, [32, 1, 1500, 16, 2]> var_286_cast_fp16 = stack(axis = var_286_axis_0, values = (var_284_cast_fp16, x1_5_cast_fp16))[name = string("op_286_cast_fp16")];
            tensor<int32, [4]> concat_17 = const()[name = string("concat_17"), val = tensor<int32, [4]>([32, 1, 1500, 32])];
            tensor<fp16, [32, 1, 1500, 32]> var_287_cast_fp16 = reshape(shape = concat_17, x = var_286_cast_fp16)[name = string("op_287_cast_fp16")];
            tensor<fp16, [1500, 32]> var_288_to_fp16 = const()[name = string("op_288_to_fp16"), val = tensor<fp16, [1500, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2369472)))];
            tensor<fp16, [32, 1, 1500, 32]> var_289_cast_fp16 = mul(x = var_287_cast_fp16, y = var_288_to_fp16)[name = string("op_289_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 32]> q_3_cast_fp16 = add(x = var_279_cast_fp16, y = var_289_cast_fp16)[name = string("q_3_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 32]> var_304_cast_fp16 = mul(x = t_7_cast_fp16, y = var_278_to_fp16)[name = string("op_304_cast_fp16")];
            tensor<int32, [5]> concat_20 = const()[name = string("concat_20"), val = tensor<int32, [5]>([32, 1, 1500, -1, 2])];
            tensor<fp16, [32, 1, 1500, 16, 2]> x_13_cast_fp16 = reshape(shape = concat_20, x = t_7_cast_fp16)[name = string("x_13_cast_fp16")];
            tensor<int32, [5]> x1_7_begin_0 = const()[name = string("x1_7_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> x1_7_end_0 = const()[name = string("x1_7_end_0"), val = tensor<int32, [5]>([32, 1, 1500, 16, 1])];
            tensor<bool, [5]> x1_7_end_mask_0 = const()[name = string("x1_7_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x1_7_squeeze_mask_0 = const()[name = string("x1_7_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [32, 1, 1500, 16]> x1_7_cast_fp16 = slice_by_index(begin = x1_7_begin_0, end = x1_7_end_0, end_mask = x1_7_end_mask_0, squeeze_mask = x1_7_squeeze_mask_0, x = x_13_cast_fp16)[name = string("x1_7_cast_fp16")];
            tensor<int32, [5]> x2_7_begin_0 = const()[name = string("x2_7_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 1])];
            tensor<int32, [5]> x2_7_end_0 = const()[name = string("x2_7_end_0"), val = tensor<int32, [5]>([32, 1, 1500, 16, 2])];
            tensor<bool, [5]> x2_7_end_mask_0 = const()[name = string("x2_7_end_mask_0"), val = tensor<bool, [5]>([true, true, true, true, false])];
            tensor<bool, [5]> x2_7_squeeze_mask_0 = const()[name = string("x2_7_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, false, false, true])];
            tensor<fp16, [32, 1, 1500, 16]> x2_7_cast_fp16 = slice_by_index(begin = x2_7_begin_0, end = x2_7_end_0, end_mask = x2_7_end_mask_0, squeeze_mask = x2_7_squeeze_mask_0, x = x_13_cast_fp16)[name = string("x2_7_cast_fp16")];
            fp16 const_23_promoted_to_fp16 = const()[name = string("const_23_promoted_to_fp16"), val = fp16(-0x1p+0)];
            tensor<fp16, [32, 1, 1500, 16]> var_309_cast_fp16 = mul(x = x2_7_cast_fp16, y = const_23_promoted_to_fp16)[name = string("op_309_cast_fp16")];
            int32 var_311_axis_0 = const()[name = string("op_311_axis_0"), val = int32(-1)];
            tensor<fp16, [32, 1, 1500, 16, 2]> var_311_cast_fp16 = stack(axis = var_311_axis_0, values = (var_309_cast_fp16, x1_7_cast_fp16))[name = string("op_311_cast_fp16")];
            tensor<int32, [4]> concat_21 = const()[name = string("concat_21"), val = tensor<int32, [4]>([32, 1, 1500, 32])];
            tensor<fp16, [32, 1, 1500, 32]> var_312_cast_fp16 = reshape(shape = concat_21, x = var_311_cast_fp16)[name = string("op_312_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 32]> var_314_cast_fp16 = mul(x = var_312_cast_fp16, y = var_288_to_fp16)[name = string("op_314_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 32]> k_3_cast_fp16 = add(x = var_304_cast_fp16, y = var_314_cast_fp16)[name = string("k_3_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 32]> out_5_cast_fp16 = scaled_dot_product_attention(key = k_3_cast_fp16, query = q_3_cast_fp16, value = v_3_cast_fp16)[name = string("out_5_cast_fp16")];
            tensor<fp16, [1, 32]> model_frontend_blocks_0_partial_attnT_to_gates_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnT_to_gates_weight_to_fp16"), val = tensor<fp16, [1, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2465536)))];
            tensor<fp16, [1]> model_frontend_blocks_0_partial_attnT_to_gates_bias_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnT_to_gates_bias_to_fp16"), val = tensor<fp16, [1]>([0x1.99p-5])];
            tensor<fp16, [32, 1500, 1]> linear_6_cast_fp16 = linear(bias = model_frontend_blocks_0_partial_attnT_to_gates_bias_to_fp16, weight = model_frontend_blocks_0_partial_attnT_to_gates_weight_to_fp16, x = input_39_cast_fp16)[name = string("linear_6_cast_fp16")];
            tensor<int32, [3]> var_320 = const()[name = string("op_320"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> gates_3_axes_0 = const()[name = string("gates_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32, 1, 1500]> var_321_cast_fp16 = transpose(perm = var_320, x = linear_6_cast_fp16)[name = string("transpose_88")];
            tensor<fp16, [32, 1, 1500, 1]> gates_3_cast_fp16 = expand_dims(axes = gates_3_axes_0, x = var_321_cast_fp16)[name = string("gates_3_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 1]> var_323_cast_fp16 = sigmoid(x = gates_3_cast_fp16)[name = string("op_323_cast_fp16")];
            tensor<fp16, [32, 1, 1500, 32]> out_7_cast_fp16 = mul(x = out_5_cast_fp16, y = var_323_cast_fp16)[name = string("out_7_cast_fp16")];
            tensor<int32, [4]> var_325 = const()[name = string("op_325"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_22 = const()[name = string("concat_22"), val = tensor<int32, [3]>([32, 1500, 32])];
            tensor<fp16, [32, 1500, 1, 32]> var_326_cast_fp16 = transpose(perm = var_325, x = out_7_cast_fp16)[name = string("transpose_87")];
            tensor<fp16, [32, 1500, 32]> input_41_cast_fp16 = reshape(shape = concat_22, x = var_326_cast_fp16)[name = string("input_41_cast_fp16")];
            tensor<fp16, [32, 32]> model_frontend_blocks_0_partial_attnT_to_out_0_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_attnT_to_out_0_weight_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2465664)))];
            tensor<fp16, [32]> linear_7_bias_0_to_fp16 = const()[name = string("linear_7_bias_0_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2467776)))];
            tensor<fp16, [32, 1500, 32]> linear_7_cast_fp16 = linear(bias = linear_7_bias_0_to_fp16, weight = model_frontend_blocks_0_partial_attnT_to_out_0_weight_to_fp16, x = input_41_cast_fp16)[name = string("linear_7_cast_fp16")];
            tensor<fp16, [32, 1500, 32]> input_45_cast_fp16 = add(x = input_37_cast_fp16, y = linear_7_cast_fp16)[name = string("input_45_cast_fp16")];
            tensor<int32, [1]> var_338 = const()[name = string("op_338"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32, 1500, 1]> var_339_cast_fp16 = reduce_l2_norm(axes = var_338, keep_dims = var_55, x = input_45_cast_fp16)[name = string("op_339_cast_fp16")];
            tensor<fp16, [32, 1500, 1]> var_340_cast_fp16 = maximum(x = var_339_cast_fp16, y = var_59_to_fp16)[name = string("op_340_cast_fp16")];
            tensor<int32, [3]> denom_7_reps_0 = const()[name = string("denom_7_reps_0"), val = tensor<int32, [3]>([1, 1, 32])];
            tensor<fp16, [32, 1500, 32]> denom_7_cast_fp16 = tile(reps = denom_7_reps_0, x = var_340_cast_fp16)[name = string("denom_7_cast_fp16")];
            tensor<fp16, [32, 1500, 32]> var_342_cast_fp16 = real_div(x = input_45_cast_fp16, y = denom_7_cast_fp16)[name = string("op_342_cast_fp16")];
            fp16 var_343_to_fp16 = const()[name = string("op_343_to_fp16"), val = fp16(0x1.6ap+2)];
            tensor<fp16, [32, 1500, 32]> var_344_cast_fp16 = mul(x = var_342_cast_fp16, y = var_343_to_fp16)[name = string("op_344_cast_fp16")];
            tensor<fp16, [32]> model_frontend_blocks_0_partial_ffT_net_0_gamma_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffT_net_0_gamma_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2467904)))];
            tensor<fp16, [32, 1500, 32]> input_47_cast_fp16 = mul(x = var_344_cast_fp16, y = model_frontend_blocks_0_partial_ffT_net_0_gamma_to_fp16)[name = string("input_47_cast_fp16")];
            tensor<fp16, [128, 32]> model_frontend_blocks_0_partial_ffT_net_1_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffT_net_1_weight_to_fp16"), val = tensor<fp16, [128, 32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2468032)))];
            tensor<fp16, [128]> model_frontend_blocks_0_partial_ffT_net_1_bias_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffT_net_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2476288)))];
            tensor<fp16, [32, 1500, 128]> linear_8_cast_fp16 = linear(bias = model_frontend_blocks_0_partial_ffT_net_1_bias_to_fp16, weight = model_frontend_blocks_0_partial_ffT_net_1_weight_to_fp16, x = input_47_cast_fp16)[name = string("linear_8_cast_fp16")];
            string input_51_mode_0 = const()[name = string("input_51_mode_0"), val = string("EXACT")];
            tensor<fp16, [32, 1500, 128]> input_51_cast_fp16 = gelu(mode = input_51_mode_0, x = linear_8_cast_fp16)[name = string("input_51_cast_fp16")];
            tensor<fp16, [32, 128]> model_frontend_blocks_0_partial_ffT_net_4_weight_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffT_net_4_weight_to_fp16"), val = tensor<fp16, [32, 128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2476608)))];
            tensor<fp16, [32]> model_frontend_blocks_0_partial_ffT_net_4_bias_to_fp16 = const()[name = string("model_frontend_blocks_0_partial_ffT_net_4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2484864)))];
            tensor<fp16, [32, 1500, 32]> linear_9_cast_fp16 = linear(bias = model_frontend_blocks_0_partial_ffT_net_4_bias_to_fp16, weight = model_frontend_blocks_0_partial_ffT_net_4_weight_to_fp16, x = input_51_cast_fp16)[name = string("linear_9_cast_fp16")];
            tensor<fp16, [32, 1500, 32]> var_355_cast_fp16 = add(x = input_45_cast_fp16, y = linear_9_cast_fp16)[name = string("op_355_cast_fp16")];
            tensor<int32, [4]> concat_23 = const()[name = string("concat_23"), val = tensor<int32, [4]>([1, -1, 1500, 32])];
            tensor<fp16, [1, 32, 1500, 32]> var_357_cast_fp16 = reshape(shape = concat_23, x = var_355_cast_fp16)[name = string("op_357_cast_fp16")];
            tensor<int32, [4]> var_358 = const()[name = string("op_358"), val = tensor<int32, [4]>([0, 3, 1, 2])];
